#!/usr/bin/env python
# -*- coding: utf8 -*-

'''
睡夢中，恍惚之間你睜開眼皮卻不是看到熟悉的小夜燈，而是斑駁的銹鐵窗，同時雙腿的麻木感讓你知道自己在這把木椅上睏了數個小時。
利用行動不便的這段期間你觀察了四周，沒有太多的線索但你知道這是一層平面建築有兩間房間，而你現在位於大廳。
左顧右盼，似乎能顯示訊息的只有地上的半截信封殘篇，還有茶几上的深紅色書衣舊式筆記本
從3/5也就是第一篇 <diary_3.5_.txt> 開始閱讀 …

*hint 1：me.py 的系列檔案都可以直接打開，根據內文的步驟，會引導你找出線索
*hint 2：前一位到訪者記錄下了一些線索，他都寫在日記本裡，並依日期(diary_3.5_)分類，如果你進到某間房間卻沒有頭緒，不妨閱讀日記

*** 在開始之前，如果你還沒有安裝pillow套件，請記得安裝！ 操作步驟：在終端機執行 pip install Pillow ***

*** 破解所有謎題後，遊戲最後需要你整合得到的線索，直接在終端機執行leave.py檔，找出小偷 ***
'''

# 打開筆記本3/5的內容，開始閱讀
# f = open("__file name__", "r", encoding='big5')
# print(f.read())
# f.close()